# Normalization
z = (x - mean) / stdev

# Standardization
X = (x - xmin) / (xmax - xmin)

In [1]:
import pandas as pd 

salaries = pd.DataFrame({
    'Salary' : [70000, 60000, 52000],
    'Experience' : [5, 4, 1],
})

display(salaries)

   Salary  Experience
0   70000           5
1   60000           4
2   52000           1

In [2]:
def normalize_df(x):
    return (x - x.mean()) / (x.std(ddof=1))

def standardize_df(x):
    return (x - x.min()) / (x.max() - x.min())

In [4]:
normalize_df(salaries)

     Salary  Experience
0  1.034910    0.800641
1 -0.073922    0.320256
2 -0.960988   -1.120897

In [3]:
standardize_df(salaries)

     Salary  Experience
0  1.000000        1.00
1  0.444444        0.75
2  0.000000        0.00